package sample;

import javafx.scene.control.*;
import java.util.ArrayList;
import static jdk.nashorn.internal.objects.NativeString.toUpperCase;


public class Controller {

    public TextField Smalltext1;
    public TextArea ArText;
    public Label test;
    public RadioButton choice1;
    public RadioButton choice2;
    public RadioButton choice3;
    public Label word;
    public Label st;
    public String a;
    public String gg;
    public Button Button2;
    public Button start;
    public ArrayList<String> wo = new ArrayList<>(100);
    public String[] array1;
    public Label pod;


    public void Select1() {
        a = "Цветы";
        start.setVisible(true);
        st.setVisible(true);
    }

    public void Select2() {
        a = "Города";
        start.setVisible(true);
        st.setVisible(true);
    }

    public void Select3() {
        a = "Животные";
        start.setVisible(true);
        st.setVisible(true);
    }


    public void start() {
        st.setVisible(true);
        pod.setVisible(true);
        choice1.setVisible(false);
        choice2.setVisible(false);
        choice3.setVisible(false);

        if(a.equals("Цветы")){
            word.setText("Цветы");
            ArText.setVisible(true);
            ArText.setEditable(false);
            start.setVisible(false);
            Button2.setVisible(true);
            Smalltext1.setVisible(true);
            st.setText("");
            Smalltext1.setText("");
            wo.add("Абутилон");
            // word.setText("Начали");
            ArText.appendText("Абутилон" + "\n");
            String s = "Aбутилион";
            int s1 = s.length();
            int s2 = s.length() - 1;
            String s3 = s.substring(s2, s1);
            s3 = toUpperCase(s3);
            st.setText("Тебе на: " + s3);
            gg = s3;
            array1 = new String[]{"Абутилон", "Авран", "Агава", "Агапантус", "Агератум", "Аглаонема", "Адениум", "Адокса", "Адонис", "Азалия", "Азистазия", "Азолла", "Аир", "Аистник", "Айлостера", "Акалифа", "Акант", "Аквилегия", "Акебия", "Акка", "Аконит", "Акроклиниум", "Актинидия", "Алиссум", "Алламанда", "Алоказия", "Алоэ", "Алтей", "Альпиния", "Альстремерия", "Альтернантера", "Амарант", "Амарантус", "Амариллис", "Амбрелла", "Амми", "Ананас", "Ангрекум", "Анемон", "Анемона", "Антирринум", "Антуриум", "Анцистрокактус", "Анютины", "Апельсин", "Апорокактус", "Арабис", "Аралия", "Ардизия", "Ариокарпус", "Арктотис", "Армерия", "Арника", "Артишок", "Арундо", "Арункус", "Аскоцентрус", "Аспидистра", "Асплениум", "Астильба", "Астра", "Астрагал", "Астранция", "Астрофитум", "Аукуба", "Аулиза", "Аустроцефалоцереус", "Аустроцилиндропунция", "Афеляндра", "Ахиллея", "Ахименес", "Ахирантес", "Ацидантера", "Ацтекиум", "Аэрангис", "Аэридес", "Бадан", "Бальзамин", "Бамбук", "Баптизия", "Барбарис", "Барвинок", "Бархатец", "Беарграсс", "Бегония", "Бедренец", "Безвременник", "Белена", "Белладонна", "Белокопытник", "Белопероне", "Белоцветник", "Бемерия", "Береза", "Бересклет", "Бигнония", "Бильбергия", "Бирючина", "Бобы", "Бодяк", "Бойкиния", "Болиголов", "Борец", "Борщевик", "Боувардия", "Боярышник", "Брандушка", "Брасика", "Браунингия", "Брахиглотис", "Брахилена", "Броваллия", "Бромелии", "Бруния", "Бруннера", "Брунфельзия", "Брусника", "Бубенчик", "Бугенвиллия", "Будра", "Бузульник", "Букашник", "Буквица", "Бульбофиллум", "Буплерум", "Ваксфлауэр", "Валерьяна", "Валлота", "Василек", "Василисник", "Вахта", "Вейник", "Венерин", "Вербейник", "Вербена", "Вереск", "Вероника", "Весенник", "Ветреница", "Вех", "Вечерница", "Вибурнум", "Виггинсия", "Виноград", "Виноградовник", "Виола", "Вистерия", "Водокрас", "Водосбор", "Войлочная", "Волжанка", "Вороний", "Восточный", "Вриезия", "Вудвардия", "Вьюнок", "Вязель", "Гайлардия", "Галакс", "Галинзога", "Гвоздика", "Геликония", "Гелихризум", "Гемантус", "Георгин", "Георгина", "Герань", "Гербера", "Гермини", "Гиацинт", "Гиацинтик", "Гибискус", "Гиперикум", "Гипестес", "Гиппеаструм", "Гипсофила", "Гладиолус", "Глициния", "Глоксиния", "Глориоза", "Голубика", "Горец", "Горицвет", "Горох", "Горошек", "Гортензия", "Горчица", "Гофмания", "Гравилат", "Грушанка", "Гусиный", "Гусмания", "Девичий", "Дельфиниум", "Дербенник", "Дипладения", "Диффенбахия", "Дихоризандра", "Дицентра", "Донник", "Драцена", "Дудник", "Дурман", "Душица", "Евпаториум", "Ежевика", "Ежеголовник", "Ель", "Жасмин", "Желтушник", "Женьшень", "Жерушник", "Живокость", "Живучка", "Жимолость", "Замиакулькас", "Зантедеския", "Заячья", "Звездчатка", "Зверобой", "Зебрина", "Зеленчук", "Земляника", "Зефирантес", "Зигокактус", "Золотарник", "Золотая", "Зопник", "Зюзник", "Иберис", "Иван-чай", "Иглица", "Икотник", "Илекс", "Ипомея", "Ирга", "Ирезине", "Иридодиктиум", "Ирис", "Кадзура", "Каладиум", "Каланхое", "Калатея", "Календула", "Калина", "Калистегия", "Калла", "Каллизия", "Каллистемои", "Калоцефалус", "Калужница", "Кальцеолярия", "Камелия", "Камнеломка", "Кампанула", "Кампелия", "Кампсис", "Кандык", "Канна", "Каприфоль", "Капуста", "Карнегия", "Касатик", "Кастаноспермум", "Катазетум", "Катальпа", "Катарантус", "Каттлея", "Качим", "Квамоклит", "Кентрантус", "Кермек", "Кизляк", "Кипарис", "Кипрей", "Кирказон", "Кислица", "Кларкия", "Клевер", "Клейния", "Клейстокактус", "Клематис", "Клен", "Клеома", "Клеродендрум", "Клещевина", "Кливия", "Клоповник", "Клубника", "Клюква", "Книфофия", "Княжик", "Кобея", "Ковыль", "Кодиеум", "Козлобородник", "Кокос", "Колеус", "Колокольчик", "Колумнея", "Копытень", "Корал", "Кордилина", "Кореопсис", "Коринокарпус", "Корифанта", "Коровяк", "Короставник", "Космея", "Костер", "Костяника", "Кофейное", "Кохемия", "Кохия", "Кошачья", "Крайнция", "Крапива", "Краспедия", "Крассула", "Крестовник", "Кривоцвет", "Кринум", "Криптбергия", "Кровохлебка", "Крокус", "Кроссандра", "Крушина", "Крыжовник", "Кубышка", "Кувшинка", "Кульбаба", "Купальница", "Купена", "Купырь", "Куркулиго", "Кустовая", "Лабазник", "Лаванда", "Лаватера", "Лавр", "Лаконос", "Ландыш", "Лантана", "Лапчатка", "Латирус", "Лебеда", "Левзея", "Левкой", "Лейхтенбергия", "Лелия", "Лен", "Леписмиум", "Летний", "Леукадендрон", "Лиатрис", "Ливинстона", "Лигодиум", "Лигустикум", "Лизиантус", "Ликаста", "Лилейник", "Лилия", "Лимон", "Лимониум", "Лимонник", "Листовик", "Литопс", "Лихнис", "Лобелия", "Лобивия", "Ломонос", "Лопух", "Лотос", "Луговик", "Луносемянник", "Львиный", "Льнянка", "Любка", "Люпин", "Люпины", "Лютик", "Люцерна", "Лядвенец", "Магнолия", "Магония", "Майник", "Мак", "Макодес", "Максиллярия", "Малус", "Мальва", "Мамиллярия", "Мамилярия", "Маммиллодия", "Маммиллярия", "Маммилярия", "Манжетка", "Манжетки", "Маранта", "Маргаритка", "Маршаллоцереус", "Маршанция", "Марь", "Марьянник", "Матрикария", "Маттиола", "Мать-и-мачеха", "Мачок", "Мединилла", "Медиолобивия", "Медуница", "Мезембриантемум", "Мелисса", "Мелколепестник", "Мелокактус", "Мерендера", "Метросидерос", "Микролепия", "Мильтония", "Мимоза", "Мимулюс", "Минуарция", "Мирт", "Миртиллокактус", "Можжевельник", "Молодило", "Молочай", "Молуцелла", "Монарда", "Монстера", "Монтбреция", "Морозник", "Муррайя", "Муррея", "Мускари", "Мыльнянка", "Мышиный", "Мюленбекия", "Мягковолосник", "Мята", "Мятлик", "Навахоа", "Нандина", "Наперстянка", "Наперстянка", "Нарцисс", "Настурция", "Наутилокаликс", "Недотрога", "Незабудка", "Немезия", "Необессия", "Неогомесия", "Неоллойдия", "Неопортерия", "Неочиления", "Непентес", "Нерине", "Нертера", "Нефролепис", "Нивяник", "Нолина", "Норичник", "Нотокактус", "Ночная", "Обвойник", "Обрегония", "Овсяница", "Одонтоглоссум", "Одуванчик", "Озотамнус", "Окопник", "Олеандр", "Онцидиум", "Оплисменус", "Опунция", "Ореоцереус", "Ороя", "Ортилия", "Орхидея", "Ослинник", "Османтус", "Осока", "Осот", "Офиопогон", "Охна", "Очанка", "Очиток", "Падуб", "Палисота", "Пальмы", "Пальчатокоренник", "Панданус", "Паникум", "Парадизея", "Пародия", "Паслен", "Паслен", "Паслён", "Пассифлора", "Пастернак", "Пастушья", "Пафиопедилум", "Пафиопедилюм", "Пахира", "Пахистахис", "Пеларгония", "Пелецифора", "Пеллея", "Пеллиония", "Пеперомия", "Первоцвет", "Перекати-поле", "Перелеска", "Перец", "Перилла", "Петуния", "Печеночница", "Пиафлор", "Пижма", "Пикульник", "Пилея", "Пилосоцереус", "Пион", "Пионовидная", "Пионы", "Пиретрум", "Писташ", "Питтоспорум", "Платицериум", "Плейоне", "Плектрантус", "Плющ", "Погремок", "Подмаренник", "Подорожник", "Подснежник", "Подсолнечник", "Полевица", "Полынь", "Портулак", "Примула", "Пролеска", "Прострел", "Протея", "Псевдолобивия", "Псевдоэрантемум", "Псевдоэспостоя", "Псевдэрантемум", "Псидиум", "Птерис", "Птицемлечник", "Пуансеттия", "Пульсатилла", "Пустырник", "Пушкиния", "Райграс", "Ранункулус", "Рдест", "Ребуция", "Ребуция", "Ребютия", "Ревень", "Редька", "Резеда", "Резуха", "Рео", "Репешок", "Рипсалидопсис", "Рипсалис", "Рогоз", "Родригезия", "Роео", "Роза", "Розмарин", "Розовая", "Розы", "Ромашка", "Ромашник", "Росянка", "Роузокактус", "Рудбекия", "Рускус", "Русселия", "Руэллия", "Рябчик", "Сабельник", "Саговник", "Садовая", "Саксифрага", "Салал", "Сальвия", "Сальпиглоссис", "Самшит", "Сансевиерия", "Сантини", "Сантолина", "Саурурус", "Свербига", "Свинчатка", "Седмичник", "Селезеночник", "Сенполия", "Сердечник", "Серпуха", "Сеткреазия", "Сивец", "Сидерасис", "Сизаль", "Сингониум", "Синеголовник", "Синнингия", "Синюха", "Сирень", "Сирень", "Скабиоза", "Скимия", "Смитианта", "Смолёвка", "Смолёвка", "Смолка", "Смородина", "Сныть", "Сокирки", "Солейролия", "Солидаго", "Солнцецвет", "Софронитис", "Спарманния", "Спатифиллум", "Стангопея", "Стапелия", "Статица", "Стеблеклонник", "Стрелитция", "Стрелиция", "Стрелолист", "Стрептокарпус", "Стромбокактус", "Сулькоребуция", "Сумочник", "Сурепица", "Сурепка", "Сусак", "Сушеница", "Сцилла", "Сциндапсус", "Сыть", "Табак", "Таволга", "Талия", "Танацетум", "Текомария", "Телорез", "Тетрастигма", "Тимьян", "Тласпи", "Толмия", "Толстянка", "Традесканция", "Трахелиум", "Трахелоспермум", "Трахикарпус", "Триллиум", "Трихоцереус", "Туевик", "Тумия", "Тунбергия", "Турбиникарпус", "Туя", "Тысячелистник", "Тюльпан", "Фаленопсис", "Фанерофлебия", "Фасоль", "Фатсия", "Фатсхедера", "Фаюс", "Ферокактус", "Фиалка", "Физалис", "Физостегия", "Фикус", "Филодендрон", "Финик", "Флебодиум", "Флокс", "Франкоа", "Фреезия", "Фрезия", "Фремонтия", "Фуксия", "Хавортия", "Хагеоцереус", "Хамедорея", "Хамеропс", "Хамецереус", "Хатиора", "Хвощ", "Хедера", "Хехтия", "Хлопок", "Хлорантус", "Хлорофитум", "Хмель", "Ховея", "Хойя", "Хормидиум", "Хоста", "Хохлатка", "Хрен", "Хризантема", "Хризолидокарпус", "Целогина", "Целозия", "Цереус", "Цефалоцереус", "Цианотис", "Цикас", "Цикламен", "Цикорий", "Цилиндропунция", "Цинерария", "Циния", "Цинния", "Циперус", "Циссус", "Частуха", "Череда", "Черника", "Черноголовка", "Чертополох", "Чина", "Чистец", "Чистотел", "Чистяк", "Чубушник", "Шалфей", "Шеффлера", "Шиповник", "Шлемник", "Шлюмбергера", "Шнитт-лук", "Щавель", "Эвкалипт", "Эдельвейс", "Эндимион", "Энотера", "Энцефалокарпус", "Энциклия", "Эониум", "Эпидендрум", "Эписция", "Эпителанта", "Эпифиллюм", "Эрика", "Эрингиум", "Эриокактус", "Эскобария", "Эспостоя", "Эсхинантус", "Этлингера", "Эухарис", "Эхеверия", "Эхинокактус", "Эхинопсис", "Эхинофоссулокактус", "Эхиноцереус", "Эхмея", "Эшшольция", "Юкка", "Якобиния", "Ясколка", "Яснотка", "Ястребинка", "Ятрышник"};

        }
        if(a.equals("Города")){
            word.setText("Города");
            ArText.setVisible(true);
            ArText.setEditable(false);
            start.setVisible(false);
            Button2.setVisible(true);
            Smalltext1.setVisible(true);
            st.setText("");
            Smalltext1.setText("");
            wo.add("Абаза");
            // word.setText("Начали");
            ArText.appendText("Абаза" + "\n");
            String s = "Абаза";
            int s1 = s.length();
            int s2 = s.length() - 1;
            String s3 = s.substring(s2, s1);
            s3 = toUpperCase(s3);
            st.setText("Тебе на: " + s3);
            gg = s3;
            array1 = new String[]{"Ахтубинск", "Абакан", "Азов", "Александров", "Алексин", "Альметьевск", "Анапа", "Ангарск", "Анжеро-Судженск", "Апатиты", "Арзамас", "Армавир", "Арсеньев", "Артем", "Архангельск", "Асбест", "Астрахань", "Ачинск", "Балаково", "Балахна", "Балашиха", "Балашов", "Барнаул", "Батайск", "Белгород", "Белебей", "Белово", "Белогорск", "Белорецк", "Белореченск", "Бердск", "Березники", "Березовский", "Бийск", "Биробиджан", "Благовещенск", "Бор", "Борисоглебск", "Боровичи", "Братск", "Брянск", "Бугульма", "Буденновск", "Бузулук", "Буйнакск", "Видное", "Владивосток", "Владикавказ", "Владимир", "Волгоград", "Волгодонск", "Волжск", "Волжский", "Вологда", "Вольск", "Воркута", "Воронеж", "Воскресенск", "Воткинск", "Всеволожск", "Выборг", "Выкса", "Вязьма", "Гатчина", "Геленджик", "Георгиевск", "Глазов", "Горно-Алтайск", "Грозный", "Губкин", "Гудермес", "Гуково", "Гусь-Хрустальный", "Дербент", "Дзержинск", "Димитровград", "Дмитров", "Долгопрудный", "Домодедово", "Донской", "Дубна", "Евпатория", "Егорьевск", "Ейск", "Екатеринбург", "Елабуга", "Елец", "Ессентуки", "Железногорск", "Жигулевск", "Жуковский", "Заречный", "Зеленогорск", "Зеленодольск", "Златоуст", "Иваново", "Ивантеевка", "Ижевск", "Избербаш", "Иркутск", "Искитим", "Ишим", "Ишимбай", "Йошкар-Ола", "Казань", "Калининград", "Калуга", "Каменск-Уральский", "Каменск-Шахтинский", "Камышин", "Канск", "Каспийск", "Кемерово", "Керчь", "Кинешма", "Кириши", "Киров", "Кирово-Чепецк", "Киселевск", "Кисловодск", "Клин", "Клинцы", "Ковров", "Когалым", "Коломна", "Комсомольск-на-Амуре", "Копейск", "Королев", "Кострома", "Котлас", "Красногорск", "Краснодар", "Краснокаменск", "Краснокамск", "Краснотурьинск", "Красноярск", "Кропоткин", "Крымск", "Кстово", "Кузнецк", "Кумертау", "Кунгур", "Курган", "Курск", "Кызыл", "Лабинск", "Лениногорск", "Ленинск-Кузнецкий", "Лесосибирск", "Липецк", "Лиски", "Лобня", "Лысьва", "Лыткарино", "Люберцы", "Магадан", "Магнитогорск", "Майкоп", "Махачкала", "Междуреченск", "Мелеуз", "Миасс", "Минусинск", "Михайловка", "Михайловск", "Мичуринск", "Москва", "Мурманск", "Муром", "Мытищи", "Назарово", "Назрань", "Нальчик", "Наро-Фоминск", "Находка", "Невинномысск", "Нерюнгри", "Нефтекамск", "Нефтеюганск", "Нижневартовск", "Нижнекамск", "Новгород", "Тагил", "Новоалтайск", "Новокузнецк", "Новокуйбышевск", "Новомосковск", "Новороссийск", "Новосибирск", "Новотроицк", "Новоуральск", "Новочебоксарск", "Новочеркасск", "Новошахтинск", "Ногинск", "Норильск", "Ноябрьск", "Нягань", "Обнинск", "Одинцово", "Озерск", "Октябрьский", "Омск", "Орел", "Оренбург", "Орехово-Зуево", "Орск", "Павлово", "Пенза", "Первоуральск", "Пермь", "Петрозаводск", "Петропавловск-Камчатский", "Подольск", "Полевской", "Прокопьевск", "Прохладный", "Псков", "Пушкино", "Пятигорск", "Раменское", "Ревда", "Реутов", "Ржев", "Рославль", "Россошь", "Ростов-на-Дону", "Рубцовск", "Рыбинск", "Рязань", "Салават", "Сальск", "Самара", "Санкт-Петербург", "Саранск", "Сарапул", "Саратов", "Саров", "Свободный", "Севастополь", "Северодвинск", "Северск", "Серов", "Серпухов", "Сертолово", "Сибай", "Симферополь", "Славянск-на-Кубани", "Смоленск", "Соликамск", "Солнечногорск", "Сочи", "Ставрополь", "Стерлитамак", "Ступино", "Сургут", "Сызрань", "Сыктывкар", "Таганрог", "Тамбов", "Тверь", "Тимашевск", "Тихвин", "Тихорецк", "Тобольск", "Тольятти", "Томск", "Троицк", "Туапсе", "Туймазы", "Тула", "Тюмень", "Узловая", "Улан-Удэ", "Ульяновск", "Урус-Мартан", "Усолье-Сибирское", "Уссурийск", "Усть-Илимск", "Уфа", "Ухта", "Феодосия", "Фрязино", "Хабаровск", "Ханты-Мансийск", "Хасавюрт", "Химки", "Чайковский", "Чапаевск", "Чебоксары", "Челябинск", "Черемхово", "Череповец", "Черкесск", "Черногорск", "Чехов", "Чистополь", "Чита", "Шадринск", "Шали", "Шахты", "Шуя", "Щекино", "Щелково", "Электросталь", "Элиста", "Энгельс", "Южно-Сахалинск", "Юрга", "Якутск", "Ялта", "Ярославль,","Абаза", "Абакан", "Абвиль", "Абдулино", "Абиджан", "Абинск", "Абу-Даби", "Абуджа", "Авиньон", "Агидель", "Агадир", "Агрыз", "Адана", "Аддис-Абеба", "Аделаида", "Адыгейск", "Азнакаево", "Азов", "Ак-Довурак", "Акка", "Аккра", "Аксай", "Актау", "Актюбинск", "Алагир", "Алапаевск", "Алатырь", "Алдан", "Алейск", "Александрия", "Алжир", "Александров", "Александровск", "Алексеевка", "Алексин", "Алжир", "Алзамай", "Алматы", "Альметьевск", "Амман", "Амстердам", "Амурск", "Амьен", "Анадырь", "Анапа", "Ангарск", "Андреаполь", "Анжеро-Судженск", "Анива", "Анкара", "Анталья", "Антананариву", "Антверпен", "Аньшань", "Апатиты", "Апиа", "Апрелевка", "Апшеронск", "Арамиль", "Аргун", "Ардатов", "Ардон", "Арзамас", "Аркадак", "Арль", "Армавир", "Арнем", "Арсеньев", "Артём", "Артёмовск", "Артёмовский", "Архангельск", "Асбест", "Асино", "Астана", "Астрахань", "Асунсьон", "Аткарск", "Атырау", "Афины", "Ахмадабад", "Ахтубинск", "Ачинск", "Аша", "Ашдод", "Ашкелон", "Ашхабад", "Багдад", "Бад-Гаштайн", "Бад-Хофгаштайн", "Базель", "Баку", "Балчик", "Бангалор", "Бангкок", "Банско", "Бар", "Бари", "Барселона", "Бейрут", "Белград", "Белек", "Белосток", "Белфаст", "Бенидорм", "Берген", "Берлин", "Берн", "Бильбао", "Бирмингем", "Бишкек", "Бланес", "Богота", "Бодрум", "Бока-Чика", "Болонья", "Бонн", "Бордо", "Боровец", "Бостон", "Бразилиа", "Братислава", "Брашов", "Бремен", "Брест", "Брисбен", "Бристоль", "Брно", "Брюгге", "Брюссель", "Будапешт", "Будва", "Бургас", "Бухарест", "Буэнос-Айрес", "Валенсия", "Валетта", "Ванкувер", "Варадеро", "Варна", "Варшава", "Вашингтон", "Веллингтон", "Вена", "Венеция", "Верона", "Вильнюс", "Виннипег", "Висбаден", "Вифлеем", "Вроцлав", "Вьентьян", "Гаага", "Гавана", "Гагра", "Галле", "Гамбург", "Ганновер", "Гданьск", "Гдыня", "Гент", "Генуя", "Герат", "Гетеборг", "Глазго", "Гоа", "Гонконг", "Гонолулу", "Гранада", "Гран-Канария", "Грац", "Гренобль", "Гуантанамо", "Гуанчжоу", "Гудаута", "Гулрыпш", "Даалу атолл", "Давос", "Дакка", "Даламан", "Далат", "Далянь", "Дамаск", "Дананг", "Дар-эс-Салам", "Дахаб", "Дебрецен", "Дели", "Денпасар", "Детройт", "Джайпур", "Джакарта", "Джерба", "Джидда", "Дидим", "Днепропетровск", "Донецк", "Дортмунд", "Доха", "Дрезден", "Дубай", "Дублин", "Дубровник", "Дуйсбург", "Дурбан", "Душанбе", "Дюссельдорф", "Елените", "Ереван", "Женева", "Загреб", "Задар", "Закинтос", "Закопане", "Зальбах-Хинтерглем", "Зальцбург", "Запорожье", "Зеефельд", "Зёльден", "Ибица", "Иерусалим", "Измир", "Иматра", "Инсбрук", "Ираклион", "Исламабад", "Йокогама", "Йоханнесбург", "Кабул", "Кавала", "Кадис", "Каир", "Калгари", "Калифея", "Калькутта", "Кальяри", "Канберра", "Кандагар", "Канкун", "Канны", "Каппадокия", "Капри", "Каракас", "Карачи", "Карлсруэ", "Касабланка", "Катания", "Катманду", "Катовице", "Квебек", "Кейптаун", "Кельн", "Кемер", "Керкира", "Киев", "Кито", "Китцбюэль", "Кишинев", "Клагенфурт", "Колимбия", "Коломбо", "Конаклы", "Копенгаген", "Корфу", "Кос", "Коста-Брава", "Коста-Дорада", "Кота-Кинабалу", "Котор", "Кошице", "Краби", "Краков", "Кранево", "Кривой Рог", "Куала-Лумпур", "Куопио", "Куршавель", "Кучинг", "Кушадасы", "Лагос", "Лангкави", "Лансароте", "Ла-Пас", "Ла-Пинеда", "Ларнака", "Лас-Вегас", "Лас-Пальмас-де-Гран-Канария", "Лассити", "Лахти", "Лейпциг", "Ленгенфельд", "Ливерпуль", "Ливорно", "Лидс", "Лилль", "Лима", "Лимассол", "Линдос", "Линц", "Лион", "Лиссабон", "Ллорет-де-Мар", "Лодзь", "Лозанна", "Лондон", "Лос-Анджелес", "Луанда", "Лугано", "Луганск", "Луксор", "Лутраки", "Лхаса", "Львов", "Льеж", "Любек", "Люблин", "Любляна", "Люцерн", "Маастрихт", "Мадрид", "Майами", "Майорка", "Майрхофен", "Малага", "Мале", "Мальме", "Манавгат", "Манагуа", "Манаус", "Манила", "Манчестер", "Мармарис", "Марса-Алам", "Марсель", "Маскат", "Махдия", "Махмутлар", "Медина", "Мекка", "Мельбурн", "Мерида", "Мессина", "Мехико", "Мешхед", "Мииму атолл", "Милан", "Минск", "Мишкольц", "Момбаса", "Монастир", "Монреаль", "Монтевидео", "Муйне", "Мумбаи", "Мурсия", "Мюнстер", "Мюнхен", "Назарет", "Найроби", "Нанкин", "Нант", "Нассау", "Неаполь", "Несебр", "Нетания", "Никосия", "Ницца", "Нойштифт", "Нувейба", "Нью-Йорк", "Нюрнберг", "Нячанг", "Обзор", "Одесса", "Окленд", "Оломоуц", "Ольборг", "Олюдениз", "Ордино-Аркалис", "Орлеан", "Орхус", "Осака", "Осло", "Острава", "Оттава", "Оулу", "Охрид", "Очамчира", "Падуя", "Палермо", "Пальма-де-Майорка", "Пампорово", "Памуккале", "Панама", "Пардубице", "Париж", "Патры", "Паттайя", "Пафос", "Пекин", "Пелопоннес", "Пенанг", "Перт", "Пескара", "Пиза", "Пицунда", "Плайя-дель-Кармен", "Пловдив", "Пльзень", "Пномпень", "Подгорица", "Познань", "Поморие", "Попрад", "Порвоо", "Пореч", "Порту", "Прага", "Претория", "Протарас", "Пула", "Пунта-Кана", "Пусан", "Пуэрто-Плата", "Пхеньян", "Пхукет", "Раа атолл", "Рабат", "Равда", "Регенсбург", "Рейкьявик", "Реймс", "Ресифи", "Ретимно", "Рига", "Риека", "Рим", "Римини", "Рио-де-Жанейро", "Рованиеми", "Родос", "Росток", "Роттердам", "Салвадор", "Салоники", "Салоу", "Самарканд", "Сан-Диего", "Сан-Паулу", "Сан-Ремо", "Санта-Круз-де-Тенерифе", "Санто-Доминго", "Сантьяго", "Сантьяго-де-Куба", "Сан-Франциско", "Санья", "Саппоро", "Сарагоса", "Сарыкамыш", "Сассари", "Сафага", "Себу", "Севастополь", "Севилья", "Сегед", "Сент-Этьен", "Серфаус", "Сеул", "Сиануквиль", "Сиань", "Сиде", "Сидней", "Сиемреап", "Сиена", "Сиракуза", "Сиэтл", "Скопье", "Сольдеу", "Сопот", "Сорренто", "София", "Спарта", "Сплит", "Ставангер", "Стамбул", "Стара-Загора", "Стокгольм", "Страсбург", "Сува", "Сусс", "Сухум", "Сфакс", "Таба", "Тайбэй", "Таллин", "Тампере", "Таранто", "Таррагона", "Ташкент", "Тбилиси", "Тебриз", "Тегеран", "Тель-Авив", "Тенерифе", "Теплице", "Тиват", "Тирана", "Токио", "Томар", "Торонто", "Тосса-де-Мар", "Трабзон", "Триест", "Тромсе", "Тронхейм", "Тулон", "Тулуза", "Тунис", "Турин", "Турку", "Тяньцзинь", "Улан-Батор", "Урумчи", "Утрехт", "Ухань", "Фалираки", "Фамагуста", "Фанес", "Фантхьет", "Фару", "Фетхие", "Филадельфия", "Флоренция", "Фрайбург", "Франкфурт-на-Майне", "Фрипорт", "Фуджейра", "Фукусима", "Фуншал", "Фуэртевентура", "Хайфа", "Хаммамет", "Ханой", "Ханья", "Харбин", "Харьков", "Хевиз", "Хельсинки", "Херсониссос", "Хошимин", "Хургада", "Хьюстон", "Хэйхэ", "Цель-ам-Зее", "Церматт", "Цюрих", "Ченнаи", "Чешме", "Чиангмай", "Чикаго", "Чунцин", "Шанхай", "Шарджа", "Шарм-эль-Шейх", "Шеньжень", "Шеньян", "Штутгарт", "Щецин", "Эдинбург", "Эдмонтон", "Эйлат", "Эльблонг", "Эль-Гуна", "Эль-Пас-де-ла-Каса", "Эрзурум", "Эр-Рияд", "Ялиссос", "Янгон", "Яссы"};
        }

        if(a.equals("Животные")){
            word.setText("Животные");
            ArText.setVisible(true);
            ArText.setEditable(false);
            start.setVisible(false);
            Button2.setVisible(true);
            Smalltext1.setVisible(true);
            st.setText("");
            Smalltext1.setText("");
            wo.add("Авдотка");
            // word.setText("Начали");
            ArText.appendText("Авдотка" + "\n");
            String s = "Авдотка";
            int s1 = s.length();
            int s2 = s.length() - 1;
            String s3 = s.substring(s2, s1);
            s3 = toUpperCase(s3);
            st.setText("Тебе на: " + s3);
            gg = s3;
            array1 = new String[]{ "Коала ", "Вол ", "Камнезуб ", "Корова ", "Свинья ", "Коза ", "Лошадь ", "Мул ", "Тигр ", "Пони ", "Ягуар ", "Гиена ", "Лев ", "Солонгой ", "Фенек ", "Пума ", "Леопард ", "Хорь ", "Шакал ", "Рысь ", "Песец ", "Норка ", "Медведь ", "Гризли ", "Манул ", "Волк ", "Лисица ", "Мангуст ", "Горилла ", "Мартышка ", "Гиббон ", "Гамадрил ", "Бабуин ", "Ирбис ", "Магот ", "Панда ", "Лемур ", "Горностай ", "Кошка ", "Орангутан ", "Павиан ", "Тити ", "Макак ", "Какомицли ", "Динго ", "Шимпанзе ", "Барсук ", "Тар ", "Пуку ", "Олень ", "Енот ", "Козел ", "Милу ", "Ленивец ", "Бегемот ", "Муравьед ", "Бандикут ", "Куница ", "Валлаби ", "Кенгуру ", "Сайгак ", "Косуля ", "Лань ", "Як ", "Лось ", "Кабарга ", "Дикдик ", "Кабан ", "Зубр ", "Жираф ", "Джейран ", "Газель ", "Горал ", "Буйвол ", "Бонго ", "Бизон ", "Крот ", "Землеройка ", "Выдра ", "Выхухоль ", "Еж ", "Нерпа ", "Антилопа ", "Тюлень ", "Морж ", "Котик ", "Кошка ", "Собака ", "Лев ", "Крыса ", "Хомяк ", "Кролик ", "Заяц ", "Кит ", "Дельфин ", "Белуха ", "Кашалот ", "Косатка ", "Тапир ", "Осел ", "Кулан ", "Зебра ", "Гуанако ", "Викунья ", "Верблюд ", "Тушканчик ", "Сурок ", "Суслик ", "Соня ", "Ондатра ", "Летяга ", "Белка ", "Шиншилла ", "Нутрия ", "Дикобраз ", "Бурундук ", "Слепыш ", "Песчанка ", "Полевка ", "Капибара ", "Аплодонтия ", "Агути,","Авдотка", "Аист","Барсук", "Белобровик", "крачка", "клест", "гусь", "дятел", "коршун", "песочник", "журавль", "ласточка", "Бобр", "камышевка", "синица", "Веретенник", "зуек-галстучник", "Кроншнеп", "Улит", "куропатка", "гаичка", "Варакушка", "Верблюд", "Вертишейка", "крыса", "Воробей", "Ворон", "Ворона", "Вьюны", "Вяхирь", "гадюка", "Гага", "Галка", "водомерки", "Гаршнеп", "тарантул", "Глухарь", "Голомянка", "лазоревка", "Голуби", "Горбуша", "Горихвостка-чернушка", "Горлинка", "чечетка", "Грач", "Гризли", "Грязовик", "Губки", "Гусь-гуменник", "Дельфин", "Деряба", "Дзерень", "Дикобразы", "Поморник", "воробей", "Дрозд", "Дрофа", "Дубонос", "Дупель", "Елец", "Ехидна", "Жаворонок", "королек", "Жираф", "Жулан", "Журавль", "Зарянка", "Заяц", "пеночка", "Зеленушка", "Зимородок", "Ржанка", "Зубр", "Зяблик", "Иволга", "Кабан", "Кабарга", "Казарки", "Калуга", "Камбалы", "Каменка", "овсянка", "барсучок", "вьюрок", "Каракал", "Карась", "Кеклик", "Кефаль", "Кит", "Клест-еловик", "Клест-сосновик", "Клинтух", "Клуша", "Козел", "Козуля", "Колибри", "горлица", "Комар", "Коноплянка", "Коростель", "пищуха", "Корюшка", "Котик", "Крапивник", "нырок", "сорокопут", "Гагара", "казарка", "Краснозобик", "Криптомонада", "Крокодил", "Крохали", "Кряква", "Кукушки", "Кукша", "Кулан", "Кулик", "Куропатка", "Лайка", "Лебедь", "Лемминг", "Летяга", "Лещ", "Линь", "Лисица", "Лосось", "Лось", "мотылек", "чекан", "Лысуха", "Крачка", "мухоловка", "погоныш", "Марал", "Маринка", "Медведь", "Медуза", "Минога", "Мородунка", "Голубок", "белошейка", "пеструшка", "Огарь", "исполин", "Олень", "Ондатра", "Ореховка", "Гагар", "голубь", "Пастушок", "Певчий дрозд", "Пеганка", "весничка", "желтобровка", "теньковка", "Перевозчик", "Перепел", "Пересмешка", "Песчанка", "Пискулька", "Питон", "Пищуха", "Плавунчик", "Плотва", "Погоныш", "опоссум", "сова", "Поползень", "Попугай", "Поручейник", "Просянка", "Пуночка", "скворец", "Рысь", "Рябинник", "Рябчик", "славка", "Сайгак", "Свиристель", "Свиязь", "утка", "Соболь", "Сойка", "Соловей", "Сорока", "Стерлядь", "Стрекоза", "Стрепет", "Травник", "Тритон", "Тюлень", "Утконос", "Фазан", "Фифи", "Фламинго", "Хрустан", "Чеграва", "Чернозобик", "стриж", "Черныш", "Чечевица", "Чечетка", "Чибис", "Чиж", "Чирок", "Шилохвость", "Широконоска", "Щегол", "Щеголь", "Щур", "угорь", "Эфа", "Юрок"};

        }
    }

    public void Enter() {
        ArText.setEditable(false);
        word.setText("");
        int k = 0;
        String val = Smalltext1.getText();
        String d = val.substring(0, 1);
        d = toUpperCase(d);
        if (d.equals(gg)) {
            for (int i = 0; i < array1.length; i++) {
                if (val.equals(array1[i])) {
                    for (int j = 0; j < wo.size(); j++) {
                        if (val.equals(wo.get(j))) {
                            word.setText("Такое слово уже было");
                            k++;
                            Smalltext1.setText("");
                            break;
                        }
                    }
                    String h = word.getText();
                    if (h.equals("")) {
                        wo.add(val);
                        word.setText("Подошло");
                        ArText.appendText(val + "\n");
                        k++;
                        Smalltext1.setText("");
                        int s1 = val.length();
                        int s2 = val.length() - 1;
                        String s3 = val.substring(s2, s1);
                        s3 = toUpperCase(s3);

                        if(s3.equals("Ь")){
                            s1 = val.length()-1;
                            s2 = val.length() - 2;
                            s3 = val.substring(s2, s1);
                            s3 = toUpperCase(s3);
                        }

                        st.setText("Тебе на: " + s3);
                        gg = s3;

                                //игра бота

                        Boolean game = false;
                        int a = 0;
                        int b = array1.length;
                        while (game.equals(false)) {
                            int random_number1 = a + (int) (Math.random() * b);
                            String woRd = array1[random_number1];
                            d = woRd.substring(0, 1);
                            if (d.equals(gg)) {
                                for (int j = 0; j < wo.size(); j++) {
                                    if (woRd.equals(wo.get(j))) {
                                        game = false;
                                    }
                                    else {
                                        game = true;
                                        wo.add(woRd);
                                        word.setText("Подошло");
                                        ArText.appendText(woRd + "\n");
                                        Smalltext1.setText("");
                                        s1 = woRd.length();
                                        s2 = woRd.length() - 1;
                                        s3 = woRd.substring(s2, s1);
                                        s3 = toUpperCase(s3);

                                        if(s3.equals("Ь")){
                                            s1 = woRd.length()-1;
                                            s2 = woRd.length() - 2;
                                            s3 = woRd.substring(s2, s1);
                                            s3 = toUpperCase(s3);
                                        }

                                        st.setText("Тебе на: " + s3);
                                        gg = s3;
                                        break;
                                    }
                                }
                            }
                        }
                    }
                }
            }
            if (k == 0) {
                word.setText("Такого слова нет");
                Smalltext1.setText("");
            }
        }
        else {
            word.setText("Не та буква!");
            Smalltext1.setText("");
        }
    }
}
